
gxChar KanjiTbl[]={

	"  ! \" # $ % & \' ( ) * + , - . / "   /**/	/*半角*/
	"0 1 2 3 4 5 6 7 8 9 : ; < = > ? "   
	"@ A B C D E F G H I J K L M N O "   
	"P Q R S T U V W X Y Z [ \\ ] ^ _ "   
	"` a b c d e f g h i j k l m n o "   
	"p q r s t u v w x y z { | } ~   "   
	"　、。，．・：；？！゛゜´｀¨＾"   /**/	/*全角*/
	"￣＿ヽヾゝゞ〃仝々〆〇ー―‐／＼"   
	"～∥｜…‥‘’“”（）〔〕［］｛"   
	"｝〈〉《》「」『』【】＋－±×÷"   
	"＝≠＜＞≦≧∞∴♂♀°′″℃￥＄"   
	"￠￡％＃＆＊＠§☆★○●◎◇◆□"   
	"■△▲▽▼※〒→←↑↓〓・・・・"   
	"・・・・・・・∈∋⊆⊇⊂⊃∪∩・"   
	"・・・・・・・∧∨￢⇒⇔∀∃・・"   
	"・・・・・・・・・∠⊥⌒∂∇≡≒"   

	"≪≫√∽∝∵∫∬・・・・・・・Å"   
	"‰♯♭♪†‡¶・・・・◯・・・・"   
	"・・・・・・・・・・・０１２３４"   
	"５６７８９・・・・・・・ＡＢＣＤ"   
	"ＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴ"   
	"ＵＶＷＸＹＺ・・・・・・ａｂｃｄ"   
	"ｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔ"   
	"ｕｖｗｘｙｚ・・・・ぁあぃいぅう"   
	"ぇえぉおかがきぎくぐけげこごさざ"   
	"しじすずせぜそぞただちぢっつづて"   
	"でとどなにぬねのはばぱひびぴふぶ"   
	"ぷへべぺほぼぽまみむめもゃやゅゆ"   
	"ょよらりるれろゎわゐゑをん・・・"   
	"・・・・・・・・ァアィイゥウェエ"   
	"ォオカガキギクグケゲコゴサザシジ"   
	"スズセゼソゾタダチヂッツヅテデト"   

	"ドナニヌネノハバパヒビピフブプヘ"   
	"ベペホボポマミムメモャヤュユョヨ"   
	"ラリルレロヮワヰヱヲンヴヵヶ・・"   
	"・・・・・・ΑΒΓΔΕΖΗΘΙΚ"   
	"ΛΜΝΞΟΠΡΣΤΥΦΧΨΩ・・"   
	"・・・・・・αβγδεζηθικ"   
	"λμνξοπρστυφχψω・・"   
	"・・・・АБВГДЕЁЖЗИЙК"   
	"ЛМНОПРСТУФХЦЧШЩЪ"   
	"ЫЬЭЮЯ・・・・・・・・・・・"   
	"・・・・абвгдеёжзийк"   
	"лмнопрстуфхцчшщъ"   
	"ыьэюя・・・・・・・・・・・"   
	"・・・・・・・・①②③④⑤⑥⑦⑧"   
	"⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳ⅠⅡⅢⅣ"   
	"ⅤⅥⅦⅧⅨⅩ・㍉㌔㌢㍍㌘㌧㌃㌶㍑"   

	"㍗㌍㌦㌣㌫㍊㌻㎜㎝㎞㎎㎏㏄㎡・・"   
	"・・・・・・㍻〝〟№㏍℡㊤㊥㊦㊧"   
	"㊨㈱㈲㈹㍾㍽㍼≒≡∫∮∑√⊥∠∟"   
	"⊿∵∩∪・・・・・・・・・・・・"   

	"○○○○○○○○仝々〆○○○○○"	/*0x2130*/	/*第１水準漢字*/
	"○亜唖娃阿哀愛挨姶逢葵茜穐悪握渥"   /*0x3020*/
	"旭葦芦鯵梓圧斡扱宛姐虻飴絢綾鮎或"   /*0x3030*/
	"粟袷安庵按暗案闇鞍杏以伊位依偉囲"   /*0x3040*/
	"夷委威尉惟意慰易椅為畏異移維緯胃"   /*0x3050*/
	"萎衣謂違遺医井亥域育郁磯一壱溢逸"   /*0x3060*/
	"稲茨芋鰯允印咽員因姻引飲淫胤蔭○"   /*0x3070*/
	"○院陰隠韻吋右宇烏羽迂雨卯鵜窺丑"   /*0x3120*/
	"碓臼渦嘘唄欝蔚鰻姥厩浦瓜閏噂云運"   /*0x3130*/
	"雲荏餌叡営嬰影映曳栄永泳洩瑛盈穎"   /*0x3140*/
	"頴英衛詠鋭液疫益駅悦謁越閲榎厭円"   /*0x3150*/
	"園堰奄宴延怨掩援沿演炎焔煙燕猿縁"   /*0x3160*/

	"艶苑薗遠鉛鴛塩於汚甥凹央奥往応○"   /*0x3170*/
	"○押旺横欧殴王翁襖鴬鴎黄岡沖荻億"   /*0x3220*/
	"屋憶臆桶牡乙俺卸恩温穏音下化仮何"   /*0x3230*/
	"伽価佳加可嘉夏嫁家寡科暇果架歌河"   /*0x3240*/
	"火珂禍禾稼箇花苛茄荷華菓蝦課嘩貨"   /*0x3250*/
	"迦過霞蚊俄峨我牙画臥芽蛾賀雅餓駕"   /*0x3260*/
	"介会解回塊壊廻快怪悔恢懐戒拐改○"   /*0x3270*/
	"○魁晦械海灰界皆絵芥蟹開階貝凱劾"   /*0x3320*/
	"外咳害崖慨概涯碍蓋街該鎧骸浬馨蛙"   /*0x3330*/
	"垣柿蛎鈎劃嚇各廓拡撹格核殻獲確穫"   /*0x3340*/
	"覚角赫較郭閣隔革学岳楽額顎掛笠樫"   /*0x3350*/
	"橿梶鰍潟割喝恰括活渇滑葛褐轄且鰹"   /*0x3360*/
	"叶椛樺鞄株兜竃蒲釜鎌噛鴨栢茅萱○"   /*0x3370*/
	"○粥刈苅瓦乾侃冠寒刊勘勧巻喚堪姦"   /*0x3420*/
	"完官寛干幹患感慣憾換敢柑桓棺款歓"   /*0x3430*/
	"汗漢澗潅環甘監看竿管簡緩缶翰肝艦"   /*0x3440*/

	"莞観諌貫還鑑間閑関陥韓館舘丸含岸"   /*0x3450*/
	"巌玩癌眼岩翫贋雁頑顔願企伎危喜器"   /*0x3460*/
	"基奇嬉寄岐希幾忌揮机旗既期棋棄○"   /*0x3470*/
	"○機帰毅気汽畿祈季稀紀徽規記貴起"   /*0x3520*/
	"軌輝飢騎鬼亀偽儀妓宜戯技擬欺犠疑"   /*0x3530*/
	"祇義蟻誼議掬菊鞠吉吃喫桔橘詰砧杵"   /*0x3540*/
	"黍却客脚虐逆丘久仇休及吸宮弓急救"   /*0x3550*/
	"朽求汲泣灸球究窮笈級糾給旧牛去居"   /*0x3560*/
	"巨拒拠挙渠虚許距鋸漁禦魚亨享京○"   /*0x3570*/
	"○供侠僑兇競共凶協匡卿叫喬境峡強"   /*0x3620*/
	"彊怯恐恭挟教橋況狂狭矯胸脅興蕎郷"   /*0x3630*/
	"鏡響饗驚仰凝尭暁業局曲極玉桐粁僅"   /*0x3640*/
	"勤均巾錦斤欣欽琴禁禽筋緊芹菌衿襟"   /*0x3650*/
	"謹近金吟銀九倶句区狗玖矩苦躯駆駈"   /*0x3660*/
	"駒具愚虞喰空偶寓遇隅串櫛釧屑屈○"   /*0x3670*/
	"○掘窟沓靴轡窪熊隈粂栗繰桑鍬勲君"   /*0x3720*/

	"薫訓群軍郡卦袈祁係傾刑兄啓圭珪型"   /*0x3730*/
	"契形径恵慶慧憩掲携敬景桂渓畦稽系"   /*0x3740*/
	"経継繋罫茎荊蛍計詣警軽頚鶏芸迎鯨"   /*0x3750*/
	"劇戟撃激隙桁傑欠決潔穴結血訣月件"   /*0x3760*/
	"倹倦健兼券剣喧圏堅嫌建憲懸拳捲○"   /*0x3770*/
	"○検権牽犬献研硯絹県肩見謙賢軒遣"   /*0x3820*/
	"鍵険顕験鹸元原厳幻弦減源玄現絃舷"   /*0x3830*/
	"言諺限乎個古呼固姑孤己庫弧戸故枯"   /*0x3840*/
	"湖狐糊袴股胡菰虎誇跨鈷雇顧鼓五互"   /*0x3850*/
	"伍午呉吾娯後御悟梧檎瑚碁語誤護醐"   /*0x3860*/
	"乞鯉交佼侯候倖光公功効勾厚口向○"   /*0x3870*/
	"○后喉坑垢好孔孝宏工巧巷幸広庚康"   /*0x3920*/
	"弘恒慌抗拘控攻昂晃更杭校梗構江洪"   /*0x3930*/
	"浩港溝甲皇硬稿糠紅紘絞綱耕考肯肱"   /*0x3940*/
	"腔膏航荒行衡講貢購郊酵鉱砿鋼閤降"   /*0x3950*/
	"項香高鴻剛劫号合壕拷濠豪轟麹克刻"   /*0x3960*/

	"告国穀酷鵠黒獄漉腰甑忽惚骨狛込○"   /*0x3970*/
	"○此頃今困坤墾婚恨懇昏昆根梱混痕"   /*0x3A20*/
	"紺艮魂些佐叉唆嵯左差査沙瑳砂詐鎖"   /*0x3A30*/
	"裟坐座挫債催再最哉塞妻宰彩才採栽"   /*0x3A40*/
	"歳済災采犀砕砦祭斎細菜裁載際剤在"   /*0x3A50*/
	"材罪財冴坂阪堺榊肴咲崎埼碕鷺作削"   /*0x3A60*/
	"咋搾昨朔柵窄策索錯桜鮭笹匙冊刷○"   /*0x3A70*/
	"○察拶撮擦札殺薩雑皐鯖捌錆鮫皿晒"   /*0x3B20*/
	"三傘参山惨撒散桟燦珊産算纂蚕讃賛"   /*0x3B30*/
	"酸餐斬暫残仕仔伺使刺司史嗣四士始"   /*0x3B40*/
	"姉姿子屍市師志思指支孜斯施旨枝止"   /*0x3B50*/
	"死氏獅祉私糸紙紫肢脂至視詞詩試誌"   /*0x3B60*/
	"諮資賜雌飼歯事似侍児字寺慈持時○"   /*0x3B70*/
	"○次滋治爾璽痔磁示而耳自蒔辞汐鹿"   /*0x3C20*/
	"式識鴫竺軸宍雫七叱執失嫉室悉湿漆"   /*0x3C30*/
	"疾質実蔀篠偲柴芝屡蕊縞舎写射捨赦"   /*0x3C40*/

	"斜煮社紗者謝車遮蛇邪借勺尺杓灼爵"   /*0x3C50*/
	"酌釈錫若寂弱惹主取守手朱殊狩珠種"   /*0x3C60*/
	"腫趣酒首儒受呪寿授樹綬需囚収周○"   /*0x3C70*/
	"○宗就州修愁拾洲秀秋終繍習臭舟蒐"   /*0x3D20*/
	"衆襲讐蹴輯週酋酬集醜什住充十従戎"   /*0x3D30*/
	"柔汁渋獣縦重銃叔夙宿淑祝縮粛塾熟"   /*0x3D40*/
	"出術述俊峻春瞬竣舜駿准循旬楯殉淳"   /*0x3D50*/
	"準潤盾純巡遵醇順処初所暑曙渚庶緒"   /*0x3D60*/
	"署書薯藷諸助叙女序徐恕鋤除傷償○"   /*0x3D70*/
	"○勝匠升召哨商唱嘗奨妾娼宵将小少"   /*0x3E20*/
	"尚庄床廠彰承抄招掌捷昇昌昭晶松梢"   /*0x3E30*/
	"樟樵沼消渉湘焼焦照症省硝礁祥称章"   /*0x3E40*/
	"笑粧紹肖菖蒋蕉衝裳訟証詔詳象賞醤"   /*0x3E50*/
	"鉦鍾鐘障鞘上丈丞乗冗剰城場壌嬢常"   /*0x3E60*/
	"情擾条杖浄状畳穣蒸譲醸錠嘱埴飾○"   /*0x3E70*/
	"○拭植殖燭織職色触食蝕辱尻伸信侵"   /*0x3F20*/

	"唇娠寝審心慎振新晋森榛浸深申疹真"   /*0x3F30*/
	"神秦紳臣芯薪親診身辛進針震人仁刃"   /*0x3F40*/
	"塵壬尋甚尽腎訊迅陣靭笥諏須酢図厨"   /*0x3F50*/
	"逗吹垂帥推水炊睡粋翠衰遂酔錐錘随"   /*0x3F60*/
	"瑞髄崇嵩数枢趨雛据杉椙菅頗雀裾○"   /*0x3F70*/
	"○澄摺寸世瀬畝是凄制勢姓征性成政"   /*0x4020*/
	"整星晴棲栖正清牲生盛精聖声製西誠"   /*0x4030*/
	"誓請逝醒青静斉税脆隻席惜戚斥昔析"   /*0x4040*/
	"石積籍績脊責赤跡蹟碩切拙接摂折設"   /*0x4050*/
	"窃節説雪絶舌蝉仙先千占宣専尖川戦"   /*0x4060*/
	"扇撰栓栴泉浅洗染潜煎煽旋穿箭線○"   /*0x4070*/
	"○繊羨腺舛船薦詮賎践選遷銭銑閃鮮"   /*0x4120*/
	"前善漸然全禅繕膳糎噌塑岨措曾曽楚"   /*0x4130*/
	"狙疏疎礎祖租粗素組蘇訴阻遡鼠僧創"   /*0x4140*/
	"双叢倉喪壮奏爽宋層匝惣想捜掃挿掻"   /*0x4150*/
	"操早曹巣槍槽漕燥争痩相窓糟総綜聡"   /*0x4160*/

	"草荘葬蒼藻装走送遭鎗霜騒像増憎○"   /*0x4170*/
	"○臓蔵贈造促側則即息捉束測足速俗"   /*0x4220*/
	"属賊族続卒袖其揃存孫尊損村遜他多"   /*0x4230*/
	"太汰詑唾堕妥惰打柁舵楕陀駄騨体堆"   /*0x4240*/
	"対耐岱帯待怠態戴替泰滞胎腿苔袋貸"   /*0x4250*/
	"退逮隊黛鯛代台大第醍題鷹滝瀧卓啄"   /*0x4260*/
	"宅托択拓沢濯琢託鐸濁諾茸凧蛸只○"   /*0x4270*/
	"○叩但達辰奪脱巽竪辿棚谷狸鱈樽誰"   /*0x4320*/
	"丹単嘆坦担探旦歎淡湛炭短端箪綻耽"   /*0x4330*/
	"胆蛋誕鍛団壇弾断暖檀段男談値知地"   /*0x4340*/
	"弛恥智池痴稚置致蜘遅馳築畜竹筑蓄"   /*0x4350*/
	"逐秩窒茶嫡着中仲宙忠抽昼柱注虫衷"   /*0x4360*/
	"註酎鋳駐樗瀦猪苧著貯丁兆凋喋寵○"   /*0x4370*/
	"○帖帳庁弔張彫徴懲挑暢朝潮牒町眺"   /*0x4420*/
	"聴脹腸蝶調諜超跳銚長頂鳥勅捗直朕"   /*0x4430*/
	"沈珍賃鎮陳津墜椎槌追鎚痛通塚栂掴"   /*0x4440*/

	"槻佃漬柘辻蔦綴鍔椿潰坪壷嬬紬爪吊"   /*0x4450*/
	"釣鶴亭低停偵剃貞呈堤定帝底庭廷弟"   /*0x4460*/
	"悌抵挺提梯汀碇禎程締艇訂諦蹄逓○"   /*0x4470*/
	"○邸鄭釘鼎泥摘擢敵滴的笛適鏑溺哲"   /*0x4520*/
	"徹撤轍迭鉄典填天展店添纏甜貼転顛"   /*0x4530*/
	"点伝殿澱田電兎吐堵塗妬屠徒斗杜渡"   /*0x4540*/
	"登菟賭途都鍍砥砺努度土奴怒倒党冬"   /*0x4550*/
	"凍刀唐塔塘套宕島嶋悼投搭東桃梼棟"   /*0x4560*/
	"盗淘湯涛灯燈当痘祷等答筒糖統到○"   /*0x4570*/
	"○董蕩藤討謄豆踏逃透鐙陶頭騰闘働"   /*0x4620*/
	"動同堂導憧撞洞瞳童胴萄道銅峠鴇匿"   /*0x4630*/
	"得徳涜特督禿篤毒独読栃橡凸突椴届"   /*0x4640*/
	"鳶苫寅酉瀞噸屯惇敦沌豚遁頓呑曇鈍"   /*0x4650*/
	"奈那内乍凪薙謎灘捺鍋楢馴縄畷南楠"   /*0x4660*/
	"軟難汝二尼弐迩匂賑肉虹廿日乳入○"   /*0x4670*/
	"○如尿韮任妊忍認濡禰祢寧葱猫熱年"   /*0x4720*/

	"念捻撚燃粘乃廼之埜嚢悩濃納能脳膿"   /*0x4730*/
	"農覗蚤巴把播覇杷波派琶破婆罵芭馬"   /*0x4740*/
	"俳廃拝排敗杯盃牌背肺輩配倍培媒梅"   /*0x4750*/
	"楳煤狽買売賠陪這蝿秤矧萩伯剥博拍"   /*0x4760*/
	"柏泊白箔粕舶薄迫曝漠爆縛莫駁麦○"   /*0x4770*/
	"○函箱硲箸肇筈櫨幡肌畑畠八鉢溌発"   /*0x4820*/
	"醗髪伐罰抜筏閥鳩噺塙蛤隼伴判半反"   /*0x4830*/
	"叛帆搬斑板氾汎版犯班畔繁般藩販範"   /*0x4840*/
	"釆煩頒飯挽晩番盤磐蕃蛮匪卑否妃庇"   /*0x4850*/
	"彼悲扉批披斐比泌疲皮碑秘緋罷肥被"   /*0x4860*/
	"誹費避非飛樋簸備尾微枇毘琵眉美○"   /*0x4870*/
	"○鼻柊稗匹疋髭彦膝菱肘弼必畢筆逼"   /*0x4920*/
	"桧姫媛紐百謬俵彪標氷漂瓢票表評豹"   /*0x4930*/
	"廟描病秒苗錨鋲蒜蛭鰭品彬斌浜瀕貧"   /*0x4940*/
	"賓頻敏瓶不付埠夫婦富冨布府怖扶敷"   /*0x4950*/
	"斧普浮父符腐膚芙譜負賦赴阜附侮撫"   /*0x4960*/

	"武舞葡蕪部封楓風葺蕗伏副復幅服○"   /*0x4970*/
	"○福腹複覆淵弗払沸仏物鮒分吻噴墳"   /*0x4A20*/
	"憤扮焚奮粉糞紛雰文聞丙併兵塀幣平"   /*0x4A30*/
	"弊柄並蔽閉陛米頁僻壁癖碧別瞥蔑箆"   /*0x4A40*/
	"偏変片篇編辺返遍便勉娩弁鞭保舗鋪"   /*0x4A50*/
	"圃捕歩甫補輔穂募墓慕戊暮母簿菩倣"   /*0x4A60*/
	"俸包呆報奉宝峰峯崩庖抱捧放方朋○"   /*0x4A70*/
	"○法泡烹砲縫胞芳萌蓬蜂褒訪豊邦鋒"   /*0x4B20*/
	"飽鳳鵬乏亡傍剖坊妨帽忘忙房暴望某"   /*0x4B30*/
	"棒冒紡肪膨謀貌貿鉾防吠頬北僕卜墨"   /*0x4B40*/
	"撲朴牧睦穆釦勃没殆堀幌奔本翻凡盆"   /*0x4B50*/
	"摩磨魔麻埋妹昧枚毎哩槙幕膜枕鮪柾"   /*0x4B60*/
	"鱒桝亦俣又抹末沫迄侭繭麿万慢満○"   /*0x4B70*/
	"○漫蔓味未魅巳箕岬密蜜湊蓑稔脈妙"   /*0x4C20*/
	"粍民眠務夢無牟矛霧鵡椋婿娘冥名命"   /*0x4C30*/
	"明盟迷銘鳴姪牝滅免棉綿緬面麺摸模"   /*0x4C40*/

	"茂妄孟毛猛盲網耗蒙儲木黙目杢勿餅"   /*0x4C50*/
	"尤戻籾貰問悶紋門匁也冶夜爺耶野弥"   /*0x4C60*/
	"矢厄役約薬訳躍靖柳薮鑓愉愈油癒○"   /*0x4C70*/
	"○諭輸唯佑優勇友宥幽悠憂揖有柚湧"   /*0x4D20*/
	"涌猶猷由祐裕誘遊邑郵雄融夕予余与"   /*0x4D30*/
	"誉輿預傭幼妖容庸揚揺擁曜楊様洋溶"   /*0x4D40*/
	"熔用窯羊耀葉蓉要謡踊遥陽養慾抑欲"   /*0x4D50*/
	"沃浴翌翼淀羅螺裸来莱頼雷洛絡落酪"   /*0x4D60*/
	"乱卵嵐欄濫藍蘭覧利吏履李梨理璃○"   /*0x4D70*/
	"○痢裏裡里離陸律率立葎掠略劉流溜"   /*0x4E20*/
	"琉留硫粒隆竜龍侶慮旅虜了亮僚両凌"   /*0x4E30*/
	"寮料梁涼猟療瞭稜糧良諒遼量陵領力"   /*0x4E40*/
	"緑倫厘林淋燐琳臨輪隣鱗麟瑠塁涙累"   /*0x4E50*/
	"類令伶例冷励嶺怜玲礼苓鈴隷零霊麗"   /*0x4E60*/
	"齢暦歴列劣烈裂廉恋憐漣煉簾練聯○"   /*0x4E70*/
	"○蓮連錬呂魯櫓炉賂路露労婁廊弄朗"   /*0x4F20*/

	"楼榔浪漏牢狼篭老聾蝋郎六麓禄肋録"   /*0x4F30*/
	"論倭和話歪賄脇惑枠鷲亙亘鰐詫藁蕨"   /*0x4F40*/
	"椀湾碗腕○○○○○○○○○○○○"   /*0x4F50*/

	"○弌丐丕个丱丶丼丿乂乖乘亂亅豫亊"   /*0x5020*//*第２水準漢字*/
	"舒弍于亞亟亠亢亰亳亶从仍仄仆仂仗"   /*0x5030*/
	"仞仭仟价伉佚估佛佝佗佇佶侈侏侘佻"   /*0x5040*/
	"佩佰侑佯來侖儘俔俟俎俘俛俑俚俐俤"   /*0x5050*/
	"俥倚倨倔倪倥倅伜俶倡倩倬俾俯們倆"   /*0x5060*/
	"偃假會偕偐偈做偖偬偸傀傚傅傴傲○"   /*0x5070*/
	"○僉僊傳僂僖僞僥僭僣僮價僵儉儁儂"   /*0x5120*/
	"儖儕儔儚儡儺儷儼儻儿兀兒兌兔兢竸"   /*0x5130*/
	"兩兪兮冀冂囘册冉冏冑冓冕冖冤冦冢"   /*0x5140*/
	"冩冪冫决冱冲冰况冽凅凉凛几處凩凭"   /*0x5150*/
	"凰凵凾刄刋刔刎刧刪刮刳刹剏剄剋剌"   /*0x5160*/
	"剞剔剪剴剩剳剿剽劍劔劒剱劈劑辨○"   /*0x5170*/
	"○辧劬劭劼劵勁勍勗勞勣勦飭勠勳勵"   /*0x5220*/
	"勸勹匆匈甸匍匐匏匕匚匣匯匱匳匸區"   /*0x5230*/
	"卆卅丗卉卍凖卞卩卮夘卻卷厂厖厠厦"   /*0x5240*/
	"厥厮厰厶參簒雙叟曼燮叮叨叭叺吁吽"   /*0x5250*/

	"呀听吭吼吮吶吩吝呎咏呵咎呟呱呷呰"   /*0x5260*/
	"咒呻咀呶咄咐咆哇咢咸咥咬哄哈咨○"   /*0x5270*/
	"○咫哂咤咾咼哘哥哦唏唔哽哮哭哺哢"   /*0x5320*/
	"唹啀啣啌售啜啅啖啗唸唳啝喙喀咯喊"   /*0x5330*/
	"喟啻啾喘喞單啼喃喩喇喨嗚嗅嗟嗄嗜"   /*0x5340*/
	"嗤嗔嘔嗷嘖嗾嗽嘛嗹噎噐營嘴嘶嘲嘸"   /*0x5350*/
	"噫噤嘯噬噪嚆嚀嚊嚠嚔嚏嚥嚮嚶嚴囂"   /*0x5360*/
	"嚼囁囃囀囈囎囑囓囗囮囹圀囿圄圉○"   /*0x5370*/
	"○圈國圍圓團圖嗇圜圦圷圸坎圻址坏"   /*0x5420*/
	"坩埀垈坡坿垉垓垠垳垤垪垰埃埆埔埒"   /*0x5430*/
	"埓堊埖埣堋堙堝塲堡塢塋塰毀塒堽塹"   /*0x5440*/
	"墅墹墟墫墺壞墻墸墮壅壓壑壗壙壘壥"   /*0x5450*/
	"壜壤壟壯壺壹壻壼壽夂夊夐夛梦夥夬"   /*0x5460*/
	"夭夲夸夾竒奕奐奎奚奘奢奠奧奬奩○"   /*0x5470*/
	"○奸妁妝佞侫妣妲姆姨姜妍姙姚娥娟"   /*0x5520*/
	"娑娜娉娚婀婬婉娵娶婢婪媚媼媾嫋嫂"   /*0x5530*/

	"媽嫣嫗嫦嫩嫖嫺嫻嬌嬋嬖嬲嫐嬪嬶嬾"   /*0x5540*/
	"孃孅孀孑孕孚孛孥孩孰孳孵學斈孺宀"   /*0x5550*/
	"它宦宸寃寇寉寔寐寤實寢寞寥寫寰寶"   /*0x5560*/
	"寳尅將專對尓尠尢尨尸尹屁屆屎屓○"   /*0x5570*/
	"○屐屏孱屬屮乢屶屹岌岑岔妛岫岻岶"   /*0x5620*/
	"岼岷峅岾峇峙峩峽峺峭嶌峪崋崕崗嵜"   /*0x5630*/
	"崟崛崑崔崢崚崙崘嵌嵒嵎嵋嵬嵳嵶嶇"   /*0x5640*/
	"嶄嶂嶢嶝嶬嶮嶽嶐嶷嶼巉巍巓巒巖巛"   /*0x5650*/
	"巫已巵帋帚帙帑帛帶帷幄幃幀幎幗幔"   /*0x5660*/
	"幟幢幤幇幵并幺麼广庠廁廂廈廐廏○"   /*0x5670*/
	"○廖廣廝廚廛廢廡廨廩廬廱廳廰廴廸"   /*0x5720*/
	"廾弃弉彝彜弋弑弖弩弭弸彁彈彌彎弯"   /*0x5730*/
	"彑彖彗彙彡彭彳彷徃徂彿徊很徑徇從"   /*0x5740*/
	"徙徘徠徨徭徼忖忻忤忸忱忝悳忿怡恠"   /*0x5750*/
	"怙怐怩怎怱怛怕怫怦怏怺恚恁恪恷恟"   /*0x5760*/
	"恊恆恍恣恃恤恂恬恫恙悁悍惧悃悚○"   /*0x5770*/

	"○悄悛悖悗悒悧悋惡悸惠惓悴忰悽惆"   /*0x5820*/
	"悵惘慍愕愆惶惷愀惴惺愃愡惻惱愍愎"   /*0x5830*/
	"慇愾愨愧慊愿愼愬愴愽慂慄慳慷慘慙"   /*0x5840*/
	"慚慫慴慯慥慱慟慝慓慵憙憖憇憬憔憚"   /*0x5850*/
	"憊憑憫憮懌懊應懷懈懃懆憺懋罹懍懦"   /*0x5860*/
	"懣懶懺懴懿懽懼懾戀戈戉戍戌戔戛○"   /*0x5870*/
	"○戞戡截戮戰戲戳扁扎扞扣扛扠扨扼"   /*0x5920*/
	"抂抉找抒抓抖拔抃抔拗拑抻拏拿拆擔"   /*0x5930*/
	"拈拜拌拊拂拇抛拉挌拮拱挧挂挈拯拵"   /*0x5940*/
	"捐挾捍搜捏掖掎掀掫捶掣掏掉掟掵捫"   /*0x5950*/
	"捩掾揩揀揆揣揉插揶揄搖搴搆搓搦搶"   /*0x5960*/
	"攝搗搨搏摧摯摶摎攪撕撓撥撩撈撼○"   /*0x5970*/
	"○據擒擅擇撻擘擂擱擧舉擠擡抬擣擯"   /*0x5A20*/
	"攬擶擴擲擺攀擽攘攜攅攤攣攫攴攵攷"   /*0x5A30*/
	"收攸畋效敖敕敍敘敞敝敲數斂斃變斛"   /*0x5A40*/
	"斟斫斷旃旆旁旄旌旒旛旙无旡旱杲昊"   /*0x5A50*/

	"昃旻杳昵昶昴昜晏晄晉晁晞晝晤晧晨"   /*0x5A60*/
	"晟晢晰暃暈暎暉暄暘暝曁暹曉暾暼○"   /*0x5A70*/
	"○曄暸曖曚曠昿曦曩曰曵曷朏朖朞朦"   /*0x5B20*/
	"朧霸朮朿朶杁朸朷杆杞杠杙杣杤枉杰"   /*0x5B30*/
	"枩杼杪枌枋枦枡枅枷柯枴柬枳柩枸柤"   /*0x5B40*/
	"柞柝柢柮枹柎柆柧檜栞框栩桀桍栲桎"   /*0x5B50*/
	"梳栫桙档桷桿梟梏梭梔條梛梃檮梹桴"   /*0x5B60*/
	"梵梠梺椏梍桾椁棊椈棘椢椦棡椌棍○"   /*0x5B70*/
	"○棔棧棕椶椒椄棗棣椥棹棠棯椨椪椚"   /*0x5C20*/
	"椣椡棆楹楷楜楸楫楔楾楮椹楴椽楙椰"   /*0x5C30*/
	"楡楞楝榁楪榲榮槐榿槁槓榾槎寨槊槝"   /*0x5C40*/
	"榻槃榧樮榑榠榜榕榴槞槨樂樛槿權槹"   /*0x5C50*/
	"槲槧樅榱樞槭樔槫樊樒櫁樣樓橄樌橲"   /*0x5C60*/
	"樶橸橇橢橙橦橈樸樢檐檍檠檄檢檣○"   /*0x5C70*/
	"○檗蘗檻櫃櫂檸檳檬櫞櫑櫟檪櫚櫪櫻"   /*0x5D20*/
	"欅蘖櫺欒欖鬱欟欸欷盜欹飮歇歃歉歐"   /*0x5D30*/

	"歙歔歛歟歡歸歹歿殀殄殃殍殘殕殞殤"   /*0x5D40*/
	"殪殫殯殲殱殳殷殼毆毋毓毟毬毫毳毯"   /*0x5D50*/
	"麾氈氓气氛氤氣汞汕汢汪沂沍沚沁沛"   /*0x5D60*/
	"汾汨汳沒沐泄泱泓沽泗泅泝沮沱沾○"   /*0x5D70*/
	"○沺泛泯泙泪洟衍洶洫洽洸洙洵洳洒"   /*0x5E20*/
	"洌浣涓浤浚浹浙涎涕濤涅淹渕渊涵淇"   /*0x5E30*/
	"淦涸淆淬淞淌淨淒淅淺淙淤淕淪淮渭"   /*0x5E40*/
	"湮渮渙湲湟渾渣湫渫湶湍渟湃渺湎渤"   /*0x5E50*/
	"滿渝游溂溪溘滉溷滓溽溯滄溲滔滕溏"   /*0x5E60*/
	"溥滂溟潁漑灌滬滸滾漿滲漱滯漲滌○"   /*0x5E70*/
	"○漾漓滷澆潺潸澁澀潯潛濳潭澂潼潘"   /*0x5F20*/
	"澎澑濂潦澳澣澡澤澹濆澪濟濕濬濔濘"   /*0x5F30*/
	"濱濮濛瀉瀋濺瀑瀁瀏濾瀛瀚潴瀝瀘瀟"   /*0x5F40*/
	"瀰瀾瀲灑灣炙炒炯烱炬炸炳炮烟烋烝"   /*0x5F50*/
	"烙焉烽焜焙煥煕熈煦煢煌煖煬熏燻熄"   /*0x5F60*/
	"熕熨熬燗熹熾燒燉燔燎燠燬燧燵燼○"   /*0x5F70*/

	"○燹燿爍爐爛爨爭爬爰爲爻爼爿牀牆"   /*0x6020*/
	"牋牘牴牾犂犁犇犒犖犢犧犹犲狃狆狄"   /*0x6030*/
	"狎狒狢狠狡狹狷倏猗猊猜猖猝猴猯猩"   /*0x6040*/
	"猥猾獎獏默獗獪獨獰獸獵獻獺珈玳珎"   /*0x6050*/
	"玻珀珥珮珞璢琅瑯琥珸琲琺瑕琿瑟瑙"   /*0x6060*/
	"瑁瑜瑩瑰瑣瑪瑶瑾璋璞璧瓊瓏瓔珱○"   /*0x6070*/
	"○瓠瓣瓧瓩瓮瓲瓰瓱瓸瓷甄甃甅甌甎"   /*0x6120*/
	"甍甕甓甞甦甬甼畄畍畊畉畛畆畚畩畤"   /*0x6130*/
	"畧畫畭畸當疆疇畴疊疉疂疔疚疝疥疣"   /*0x6140*/
	"痂疳痃疵疽疸疼疱痍痊痒痙痣痞痾痿"   /*0x6150*/
	"痼瘁痰痺痲痳瘋瘍瘉瘟瘧瘠瘡瘢瘤瘴"   /*0x6160*/
	"瘰瘻癇癈癆癜癘癡癢癨癩癪癧癬癰○"   /*0x6170*/
	"○癲癶癸發皀皃皈皋皎皖皓皙皚皰皴"   /*0x6220*/
	"皸皹皺盂盍盖盒盞盡盥盧盪蘯盻眈眇"   /*0x6230*/
	"眄眩眤眞眥眦眛眷眸睇睚睨睫睛睥睿"   /*0x6240*/
	"睾睹瞎瞋瞑瞠瞞瞰瞶瞹瞿瞼瞽瞻矇矍"   /*0x6250*/

	"矗矚矜矣矮矼砌砒礦砠礪硅碎硴碆硼"   /*0x6260*/
	"碚碌碣碵碪碯磑磆磋磔碾碼磅磊磬○"   /*0x6270*/
	"○磧磚磽磴礇礒礑礙礬礫祀祠祗祟祚"   /*0x6320*/
	"祕祓祺祿禊禝禧齋禪禮禳禹禺秉秕秧"   /*0x6330*/
	"秬秡秣稈稍稘稙稠稟禀稱稻稾稷穃穗"   /*0x6340*/
	"穉穡穢穩龝穰穹穽窈窗窕窘窖窩竈窰"   /*0x6350*/
	"窶竅竄窿邃竇竊竍竏竕竓站竚竝竡竢"   /*0x6360*/
	"竦竭竰笂笏笊笆笳笘笙笞笵笨笶筐○"   /*0x6370*/
	"○筺笄筍笋筌筅筵筥筴筧筰筱筬筮箝"   /*0x6420*/
	"箘箟箍箜箚箋箒箏筝箙篋篁篌篏箴篆"   /*0x6430*/
	"篝篩簑簔篦篥籠簀簇簓篳篷簗簍篶簣"   /*0x6440*/
	"簧簪簟簷簫簽籌籃籔籏籀籐籘籟籤籖"   /*0x6450*/
	"籥籬籵粃粐粤粭粢粫粡粨粳粲粱粮粹"   /*0x6460*/
	"粽糀糅糂糘糒糜糢鬻糯糲糴糶糺紆○"   /*0x6470*/
	"○紂紜紕紊絅絋紮紲紿紵絆絳絖絎絲"   /*0x6520*/
	"絨絮絏絣經綉絛綏絽綛綺綮綣綵緇綽"   /*0x6530*/

	"綫總綢綯緜綸綟綰緘緝緤緞緻緲緡縅"   /*0x6540*/
	"縊縣縡縒縱縟縉縋縢繆繦縻縵縹繃縷"   /*0x6550*/
	"縲縺繧繝繖繞繙繚繹繪繩繼繻纃緕繽"   /*0x6560*/
	"辮繿纈纉續纒纐纓纔纖纎纛纜缸缺○"   /*0x6570*/
	"○罅罌罍罎罐网罕罔罘罟罠罨罩罧罸"   /*0x6620*/
	"羂羆羃羈羇羌羔羞羝羚羣羯羲羹羮羶"   /*0x6630*/
	"羸譱翅翆翊翕翔翡翦翩翳翹飜耆耄耋"   /*0x6640*/
	"耒耘耙耜耡耨耿耻聊聆聒聘聚聟聢聨"   /*0x6650*/
	"聳聲聰聶聹聽聿肄肆肅肛肓肚肭冐肬"   /*0x6660*/
	"胛胥胙胝胄胚胖脉胯胱脛脩脣脯腋○"   /*0x6670*/
	"○隋腆脾腓腑胼腱腮腥腦腴膃膈膊膀"   /*0x6720*/
	"膂膠膕膤膣腟膓膩膰膵膾膸膽臀臂膺"   /*0x6730*/
	"臉臍臑臙臘臈臚臟臠臧臺臻臾舁舂舅"   /*0x6740*/
	"與舊舍舐舖舩舫舸舳艀艙艘艝艚艟艤"   /*0x6750*/
	"艢艨艪艫舮艱艷艸艾芍芒芫芟芻芬苡"   /*0x6760*/
	"苣苟苒苴苳苺莓范苻苹苞茆苜茉苙○"   /*0x6770*/

	"○茵茴茖茲茱荀茹荐荅茯茫茗茘莅莚"   /*0x6820*/
	"莪莟莢莖茣莎莇莊荼莵荳荵莠莉莨菴"   /*0x6830*/
	"萓菫菎菽萃菘萋菁菷萇菠菲萍萢萠莽"   /*0x6840*/
	"萸蔆菻葭萪萼蕚蒄葷葫蒭葮蒂葩葆萬"   /*0x6850*/
	"葯葹萵蓊葢蒹蒿蒟蓙蓍蒻蓚蓐蓁蓆蓖"   /*0x6860*/
	"蒡蔡蓿蓴蔗蔘蔬蔟蔕蔔蓼蕀蕣蕘蕈○"   /*0x6870*/
	"○蕁蘂蕋蕕薀薤薈薑薊薨蕭薔薛藪薇"   /*0x6920*/
	"薜蕷蕾薐藉薺藏薹藐藕藝藥藜藹蘊蘓"   /*0x6930*/
	"蘋藾藺蘆蘢蘚蘰蘿虍乕虔號虧虱蚓蚣"   /*0x6940*/
	"蚩蚪蚋蚌蚶蚯蛄蛆蚰蛉蠣蚫蛔蛞蛩蛬"   /*0x6950*/
	"蛟蛛蛯蜒蜆蜈蜀蜃蛻蜑蜉蜍蛹蜊蜴蜿"   /*0x6960*/
	"蜷蜻蜥蜩蜚蝠蝟蝸蝌蝎蝴蝗蝨蝮蝙○"   /*0x6970*/
	"○蝓蝣蝪蠅螢螟螂螯蟋螽蟀蟐雖螫蟄"   /*0x6A20*/
	"螳蟇蟆螻蟯蟲蟠蠏蠍蟾蟶蟷蠎蟒蠑蠖"   /*0x6A30*/
	"蠕蠢蠡蠱蠶蠹蠧蠻衄衂衒衙衞衢衫袁"   /*0x6A40*/
	"衾袞衵衽袵衲袂袗袒袮袙袢袍袤袰袿"   /*0x6A50*/

	"袱裃裄裔裘裙裝裹褂裼裴裨裲褄褌褊"   /*0x6A60*/
	"褓襃褞褥褪褫襁襄褻褶褸襌褝襠襞○"   /*0x6A70*/
	"○襦襤襭襪襯襴襷襾覃覈覊覓覘覡覩"   /*0x6B20*/
	"覦覬覯覲覺覽覿觀觚觜觝觧觴觸訃訖"   /*0x6B30*/
	"訐訌訛訝訥訶詁詛詒詆詈詼詭詬詢誅"   /*0x6B40*/
	"誂誄誨誡誑誥誦誚誣諄諍諂諚諫諳諧"   /*0x6B50*/
	"諤諱謔諠諢諷諞諛謌謇謚諡謖謐謗謠"   /*0x6B60*/
	"謳鞫謦謫謾謨譁譌譏譎證譖譛譚譫○"   /*0x6B70*/
	"○譟譬譯譴譽讀讌讎讒讓讖讙讚谺豁"   /*0x6C20*/
	"谿豈豌豎豐豕豢豬豸豺貂貉貅貊貍貎"   /*0x6C30*/
	"貔豼貘戝貭貪貽貲貳貮貶賈賁賤賣賚"   /*0x6C40*/
	"賽賺賻贄贅贊贇贏贍贐齎贓賍贔贖赧"   /*0x6C50*/
	"赭赱赳趁趙跂趾趺跏跚跖跌跛跋跪跫"   /*0x6C60*/
	"跟跣跼踈踉跿踝踞踐踟蹂踵踰踴蹊○"   /*0x6C70*/
	"○蹇蹉蹌蹐蹈蹙蹤蹠踪蹣蹕蹶蹲蹼躁"   /*0x6D20*/
	"躇躅躄躋躊躓躑躔躙躪躡躬躰軆躱躾"   /*0x6D30*/

	"軅軈軋軛軣軼軻軫軾輊輅輕輒輙輓輜"   /*0x6D40*/
	"輟輛輌輦輳輻輹轅轂輾轌轉轆轎轗轜"   /*0x6D50*/
	"轢轣轤辜辟辣辭辯辷迚迥迢迪迯邇迴"   /*0x6D60*/
	"逅迹迺逑逕逡逍逞逖逋逧逶逵逹迸○"   /*0x6D70*/
	"○遏遐遑遒逎遉逾遖遘遞遨遯遶隨遲"   /*0x6E20*/
	"邂遽邁邀邊邉邏邨邯邱邵郢郤扈郛鄂"   /*0x6E30*/
	"鄒鄙鄲鄰酊酖酘酣酥酩酳酲醋醉醂醢"   /*0x6E40*/
	"醫醯醪醵醴醺釀釁釉釋釐釖釟釡釛釼"   /*0x6E50*/
	"釵釶鈞釿鈔鈬鈕鈑鉞鉗鉅鉉鉤鉈銕鈿"   /*0x6E60*/
	"鉋鉐銜銖銓銛鉚鋏銹銷鋩錏鋺鍄錮○"   /*0x6E70*/
	"○錙錢錚錣錺錵錻鍜鍠鍼鍮鍖鎰鎬鎭"   /*0x6F20*/
	"鎔鎹鏖鏗鏨鏥鏘鏃鏝鏐鏈鏤鐚鐔鐓鐃"   /*0x6F30*/
	"鐇鐐鐶鐫鐵鐡鐺鑁鑒鑄鑛鑠鑢鑞鑪鈩"   /*0x6F40*/
	"鑰鑵鑷鑽鑚鑼鑾钁鑿閂閇閊閔閖閘閙"   /*0x6F50*/
	"閠閨閧閭閼閻閹閾闊濶闃闍闌闕闔闖"   /*0x6F60*/
	"關闡闥闢阡阨阮阯陂陌陏陋陷陜陞○"   /*0x6F70*/

	"○陝陟陦陲陬隍隘隕隗險隧隱隲隰隴"   /*0x7020*/
	"隶隸隹雎雋雉雍襍雜霍雕雹霄霆霈霓"   /*0x7030*/
	"霎霑霏霖霙霤霪霰霹霽霾靄靆靈靂靉"   /*0x7040*/
	"靜靠靤靦靨勒靫靱靹鞅靼鞁靺鞆鞋鞏"   /*0x7050*/
	"鞐鞜鞨鞦鞣鞳鞴韃韆韈韋韜韭齏韲竟"   /*0x7060*/
	"韶韵頏頌頸頤頡頷頽顆顏顋顫顯顰○"   /*0x7070*/
	"○顱顴顳颪颯颱颶飄飃飆飩飫餃餉餒"   /*0x7120*/
	"餔餘餡餝餞餤餠餬餮餽餾饂饉饅饐饋"   /*0x7130*/
	"饑饒饌饕馗馘馥馭馮馼駟駛駝駘駑駭"   /*0x7140*/
	"駮駱駲駻駸騁騏騅駢騙騫騷驅驂驀驃"   /*0x7150*/
	"騾驕驍驛驗驟驢驥驤驩驫驪骭骰骼髀"   /*0x7160*/
	"髏髑髓體髞髟髢髣髦髯髫髮髴髱髷○"   /*0x7170*/
	"○髻鬆鬘鬚鬟鬢鬣鬥鬧鬨鬩鬪鬮鬯鬲"   /*0x7220*/
	"魄魃魏魍魎魑魘魴鮓鮃鮑鮖鮗鮟鮠鮨"   /*0x7230*/
	"鮴鯀鯊鮹鯆鯏鯑鯒鯣鯢鯤鯔鯡鰺鯲鯱"   /*0x7240*/
	"鯰鰕鰔鰉鰓鰌鰆鰈鰒鰊鰄鰮鰛鰥鰤鰡"   /*0x7250*/

	"鰰鱇鰲鱆鰾鱚鱠鱧鱶鱸鳧鳬鳰鴉鴈鳫"   /*0x7260*/
	"鴃鴆鴪鴦鶯鴣鴟鵄鴕鴒鵁鴿鴾鵆鵈○"   /*0x7270*/
	"○鵝鵞鵤鵑鵐鵙鵲鶉鶇鶫鵯鵺鶚鶤鶩"   /*0x7320*/
	"鶲鷄鷁鶻鶸鶺鷆鷏鷂鷙鷓鷸鷦鷭鷯鷽"   /*0x7330*/
	"鸚鸛鸞鹵鹹鹽麁麈麋麌麒麕麑麝麥麩"   /*0x7340*/
	"麸麪麭靡黌黎黏黐黔黜點黝黠黥黨黯"   /*0x7350*/
	"黴黶黷黹黻黼黽鼇鼈皷鼕鼡鼬鼾齊齒"   /*0x7360*/
	"齔齣齟齠齡齦齧齬齪齷齲齶龕龜龠○"   /*0x7370*/
	"○堯槇遙瑤凜熙○○○○○○○○○"   /*0x7420*/
};

